{"/":{"page":"/","publishedSitemap":"2019-12-28T01:17:40.242Z","publishedRSS":"Fri, 03 Mar 2006 03:36:28 GMT","title":"Stupid Simple Blog | Homepage","description":"A stupid simple free Next.js photo blog with a Netlify form database, infinite scroll, metatags and more."},"/add-blog-post":{"page":"/add-blog-post","publishedSitemap":"2011-03-04T03:36:27.377Z","publishedRSS":"Fri, 03 Mar 2006 03:36:28 GMT","title":"Add a blog post","description":"Stupid Simple Blog | Add a blog post"},"/blog-post/5e032ad81484b298500375a1":{"page":"/blog-post/5e032ad81484b298500375a1","publishedSitemap":"2019-12-25T09:24:40.368Z","publishedRSS":"Wed, 25 Dec 2019 09:24:40 GMT","title":"Tuesday night epic quest just made a test post at the super simple blog.","description":"This dive done dove off the deep end...\r\n\r\nWith no plans a for the evening and an expectation level so low you could just step over it, my roommate and I jumped in the car and set out on a Tuesday night epic quest. Armed with cashed paychecks and seeking adventure, we decided that rather than selfishly take Palm Springs by storm like a couple of immature frat boys, the much more gentlemanly route would be to donate our time and money to local performance artists showcasing their talents here in the  Palm Springs area. We somehow found ourselves at Pope's Nude Bar...\r\n\r\nThe thrill of an unlit, sketchy parking lot set far back from the comfort and safety of the bustling downtown nightlife only fueled our sense for excitement. We were unsure if the other 2 cars parked in the area belonged to fellow patrons or to tenants calling the small, crumbling apartment complex with shattered windows and littered garbage adjacent to business 'home'. Suddenly wishing for pepper spray or background training in martial arts and self defense, we locked my vehicle and pushed on to our dimly lit destination as a sea of paranoia swept over us.\r\n\r\nNo colorful lights, upbeat club music, or seductive beauties to welcome us to paradise, but rather a smug, stoic, featureless and unfriendly chap who emerged from the shadows and quickly collected our $20 cover. Inside was dark and musty and I thought for a moment we had mistakenly entered a condemned stash house. That is, until I noticed the oddly constructed, high-rise performance stage with a collection of mismatched, tattered bar stools that were just as uncomfortable to look at let alone sit on. Another employee - who I assume was the bartender yet possessed little, actual bar tending ability and many of the same outstanding qualities as the doorman - seemed irritated that the two of us had disturbed their busy evening of doing absolutely nothing. He provided us with an expensive beverage and little explanation as to where the girls might be. In fact, after we finally tracked down the ladies huddled in a cold, back room chain smoking, their demeanor was far from welcoming for guests who were here to give them money. They haphazardly made their way to the performance area offering little conversation and charm.\r\n\r\nThe saving grace for the the evening, however, was a performer by the name of Chevy, which, I'm sure is her real name of course. The only hospitable one of this cast of characters, this gal made us feel at home without the pressure of being the only two paying customers. Perhaps the most memorable moment of the evening was conversing out back, swapping life stories and future plans, genuinely engaged in the life and times of my roommate and me. Not that one typically looks for pleasant conversation when frequenting such a club, but, as a member of the service industry myself, it was certainly a refreshing spin on showing a gentlemen true hospitality. I'm sure we'll be back.\r\n\r\n...and shame on all of you for thinking my usual dirty and perverted thought process was going to take this review in the direction you thought Id take it."},"/blog-post/5e0329e691c5f53bc019a2b4":{"page":"/blog-post/5e0329e691c5f53bc019a2b4","publishedSitemap":"2019-12-25T09:20:38.771Z","publishedRSS":"Wed, 25 Dec 2019 09:20:38 GMT","title":"I had my first good in-person look at real-live, um, female genitalia and was ready to leave. just made a test post at the super simple blog.","description":"This was the first strip club I ever went to. And after that first visit, I promised Jesus it would be my last.\r\n\r\nLuckily I've adopted agnosticism since then.\r\n\r\nMy best friend Aceop and I were freshly graduated from our Christian high school near Palm Springs and bored out of our minds. When we found out we were old enough to go to a strip club, we decided to give it a try. We chose Pope's since it was the only show in town.\r\n\r\nWe were nervous, but there was no way we were backing out. Aceop parked his truck in the shaaady lot, we paid our $20 covers (pardon me, $10 cover plus $10 for two non-alcoholic drinks) and went in.\r\n\r\nThere was one other customer and one totally busted stripper. I had my first good in-person look at real-live, um, female genitalia and was ready to leave. Aceop was too.\r\n\r\nWe bounced, got to the truck, and Aceop disclosed something horrible: \"I don't have my keys.\"\r\n\r\nWe looked all over the parking lot. We went back inside and looked around the floor. Gone.\r\n\r\nWe ended up calling a friend to pick us up, because we didn't want our parents to find out where we had been. We decided God had taken the keys as punishment for this sinful activity and swore never to go to another strip club again.\r\n\r\nAceop never did find those keys. Maybe we were right about God taking them..."},"/blog-post/5e03298f4e1216ac867f111b":{"page":"/blog-post/5e03298f4e1216ac867f111b","publishedSitemap":"2019-12-25T09:19:11.771Z","publishedRSS":"Wed, 25 Dec 2019 09:19:11 GMT","title":"Crystal's lap dance just made a test post at the super simple blog.","description":"Place rocks. \r\n\r\nWent with my girlfriend and had a smashing time. \r\n\r\nCrystal and Chevy were super cool. Dug Asia too. The lady at bar was super pleasant. Highly recommend Crystal's lap dance, it provided not only acrobatics but also an endless stream of entertaining chatter and musings on life.\r\n\r\nA fun place. You need to get over the sketchy exterior. \r\n\r\nJust be cool and engage and you will have fun."},"/blog-post/5e0328e51484b2e5cc0375a2":{"page":"/blog-post/5e0328e51484b2e5cc0375a2","publishedSitemap":"2019-12-25T09:16:21.349Z","publishedRSS":"Wed, 25 Dec 2019 09:16:21 GMT","title":"A drug/rape operation in a warehouse, disguised as a disgustingly filthy strip club. just made a test post at the super simple blog.","description":"We spent 20 minutes trying to find the address online. Then another 20 minutes just trying to find the place. When we got there, it looked like a drug/rape operation in a warehouse, disguised as a disgustingly filthy strip club. We got to the door when the very large and menacing door man told us it would be $20 to get in, we turned around and left. From what I could see inside, there was NO ONE there and the music was garbage.\r\n\r\nIf you want to get murdered, raped and end up on the news, I would recommend coming here alone at night."},"/blog-post/5e03284f4e1216647f7f111a":{"page":"/blog-post/5e03284f4e1216647f7f111a","publishedSitemap":"2019-12-25T09:13:51.943Z","publishedRSS":"Wed, 25 Dec 2019 09:13:51 GMT","title":"Shabby yes, girls no. just made a test post at the super simple blog.","description":"I went with my boyfriend and another couple who we we're good friends with. We heard a couple stories about the infamous Popes.\r\nWe walked in and yeah, the inside is a bit shabby but the girls were all real friendly. There was a really pretty girl named Page who was very nice and another girl named Taylor who knew how to work the pole.\r\n\r\nIt's $20 to get in and $45 for a lap dance. They're fully nude. I think it's worth it if you'd like to see someone naked.\r\n\r\nHonestly the stories made it out to be this scary shady place but it wasn't that bad. You just have to see for yourself."},"/blog-post/5e03275c2d77765cf92a8f28":{"page":"/blog-post/5e03275c2d77765cf92a8f28","publishedSitemap":"2019-12-25T09:09:48.946Z","publishedRSS":"Wed, 25 Dec 2019 09:09:48 GMT","title":"I can't remember girls just made a test post at the super simple blog.","description":"The place is small, not very friendly, and not worth the $20 cover.  They weren't at all willing to negotiate. The last point for a group of 15 guys at a bachelor party. Didn't really see any girls worth remembering."},"/blog-post/5e032712c040a0036b0e2e52":{"page":"/blog-post/5e032712c040a0036b0e2e52","publishedSitemap":"2019-12-25T09:08:34.733Z","publishedRSS":"Wed, 25 Dec 2019 09:08:34 GMT","title":"Busted just made a test post at the super simple blog.","description":"I came here with friends.\r\nOne was named Ryan.\r\nHe barfed in the sink.\r\nI got a free can of coke.\r\nIt was BUSTED."},"/blog-post/5e032686c4ebf314d5806533":{"page":"/blog-post/5e032686c4ebf314d5806533","publishedSitemap":"2019-12-25T09:06:14.769Z","publishedRSS":"Wed, 25 Dec 2019 09:06:14 GMT","title":"Working the pole through a small window just made a test post at the super simple blog.","description":"Decided to go to Pope's with a friend who was in town for the night.  She had never been to a strip club before and since Pope's was the only one we can get into (we are only 20) we decided to give it a shot.  I had read some shady reviews, but thought i would try it anyways.  \r\n\r\nNeedless to say, we went in after paying the $20 cover (EXTREMELY OVERPRICED!) and saw nobody around.  After walking around the small (and cold) establishment, we finally ran into a few of the dancers.  We went out on the patio while they smoked and got to talking, then got a few of them on stage.\r\n\r\nThe two we watched were both VERY attractive and could work the pole.  We decided we wanted to get a 2 girl lapdance, and asked how much it would be, and to my surprise it was $45 for each girl for only 1 dance!!!!!\r\n\r\nOutrageously priced!!!!!  But I wanted my friend to have the full strip club experience, so I bit the bullet and bought us the dances.  Both girls (the ones we saw on stage) were very good in the back too, and even sexier up close.\r\n\r\nAll in all, I don't blame the girls, they worked as good as they could given the conditions they were in, but the establishment is far too over priced and the bouncers and management aren't as cool as some of the others I have run into in these smaller places.  Also this place is only open from 7pm to 2am, so it is a pretty small window.\r\n\r\nSo unless you are DESPERATE to see some girls naked, skip this place and find somewhere else."}}